////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
//
//	danmaq Nineball-Library
//		Copyright (c) 2008-2010 danmaq all rights reserved.
//
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////

namespace danmaq.nineball.entity.audio
{

	//* ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ *
	/// <summary>効果音を多重再生した場合の動作。</summary>
	enum EMultiplePlay
	{

		/// <summary>許可します。</summary>
		allow,

		/// <summary>許可せず、現在の音を停止し、再再生します。</summary>
		mono,

		/// <summary>許可せず、現在の音を全て停止し、再再生します。</summary>
		monoStrictly,

		/// <summary>許可せず、無視します。</summary>
		bypass,

		/// <summary>許可せず、例外を発行します。</summary>
		exept,

	}
}
