////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
//
//	danmaq Nineball-Library
//		Copyright (c) 2008-2009 danmaq all rights reserved.
//
//		──各設定を文字列化するクラス
//
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////


namespace danmaq.Nineball.misc {

	//* ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ *
	/// <summary>各設定を文字列化するクラス。</summary>
	public static class CToStringExtention {

		//* ────＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿＿_*
		//* methods ───────────────────────────────-*

		//* -----------------------------------------------------------------------*
		/// <summary>ブール値から○×文字列を作成します。</summary>
		/// 
		/// <param name="b">ブール値</param>
		/// <returns><paramref name="b" />に対応する○×文字列</returns>
		public static string ToStringOX( this bool b ) { return b ? "○" : "×"; }
	
	}
}
