////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
//
//	danmaq Nineball-Library
//		Copyright (c) 2008-2012 danmaq all rights reserved.
//
////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////

namespace Danmaq.Nineball.Core.State
{

	//* ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ *
	/// <summary>
	/// コンテクストと状態間で共有するカプセル化されたデータのための
	/// 必要な機能を定義しています。
	/// </summary>
	public interface IContextEncapsulation
	{

		//* instance properties ─────────────────────────-*

		/// <summary>コンテクスト本体を取得します。</summary>
		IContext Context
		{
			get;
		}

		//* instance methods ───────────────────────────*

		//* -----------------------------------------------------------------------*
		/// <summary>状態をリセットします。</summary>
		void Reset();
	}
}
